<?
/*----------------------------------------------------------------------------*/
//
//  データベースクラス
//
//  作成年月日・作成者
//    15/04/01 Mayu Kanechiku
//  開発変更履歴:
/*----------------------------------------------------------------------------*/
class Data_Base_Class {


	/*--------------------------------------------------------*/
	//  メンバー変数定義
	/*--------------------------------------------------------*/
	//	設定
	private	$host 		= "mysql.hostinger.jp";	//	ホスト名
	private $user 		= "u809743412_aike";	//	ユーザ名
	private $pass 		= "Hee0901947A";		//	パスワード
	private $DbName		= "u809743412_test";	//	データベース名

	//	コネクション
	private $Connection	;

	//	ロールバック呼出しフラグ
	private $IsBegin	= false ;




	/*----------------------------------------------------------------------------*/
	//
	//  1.概要
	//      DB接続
	//
	//  2.パラメータ説明
	//      なし
	//
	//  3.戻り値
	//      なし
	//
	//  4.機能説明
	//      なし
	//
	/*----------------------------------------------------------------------------*/
	public function connect()
	{
		$this->Connection = mysql_connect( $this->host , $this->user , $this->pass ) ;
		mysql_set_charset( "utf8" , $this->Connection ) ;
		mysql_select_db( $this->DbName , $this->Connection ) ;
	}


	/*----------------------------------------------------------------------------*/
	//
	//  1.概要
	//      DB切断
	//
	//  2.パラメータ説明
	//      なし
	//
	//  3.戻り値
	//      なし
	//
	//  4.機能説明
	//      なし
	//
	/*----------------------------------------------------------------------------*/
	public function close()
	{
		mysql_close( $this->Connection ) ;
	}


	/*----------------------------------------------------------------------------*/
	//
	//  1.概要
	//      トランザクション
	//
	//  2.パラメータ説明
	//      なし
	//
	//  3.戻り値
	//      なし
	//
	//  4.機能説明
	//      なし
	//
	/*----------------------------------------------------------------------------*/
	//---------------------------------
	//	トランザクション開始
	//---------------------------------
	public function begin()
	{
		if ( $this->IsBegin ) return ;
		mysql_query( "BEGIN" ) ;
		$this->IsBegin = true ;
	}

	//---------------------------------
	//	コミット
	//---------------------------------
	public function commit()
	{
		mysql_query( "COMMIT" ) ;
		$this->IsBegin = false ;
	}


	//---------------------------------
	//	ロールバック
	//---------------------------------
	public function rollback()
	{
		if ( !$this->IsBegin ) return ;
		mysql_query( "ROLLBACK" ) ;
		$this->IsBegin = false ;
	}




}	//	end of class

?>
