<?
/*----------------------------------------------------------------------------*/
//  ログインclass
//
//  作成年月日・作成者
//    15/04/01 Mayu Kanechiku
//  開発変更履歴:
/*----------------------------------------------------------------------------*/
require_once( $PATH_SITE_SRC_ROOT . "/common.php" ) ;
require_once( $PATH_SITE_SRC_ROOT . "/entity/ent_m_user.php" ) ;




class Login {

	public $login_error	= '0';			// ログイン成功flag（0：成功、1：失敗）




	/*----------------------------------------------------------------------------*/
	//
	//  1.概要
	//      ログイン実行
	//
	//  2.パラメータ説明
	//      なし
	//
	//  3.戻り値
	//      なし
	//
	//  4.機能説明
	//      なし
	//
	/*----------------------------------------------------------------------------*/
	public function LoginTry()
	{
		//---------------------------------
		//	ログイン
		//---------------------------------
		$EntUser = new Ent_M_User() ;
		if ( $EntUser->login_check( $_POST["Email"] , $_POST["Password"] ) ) {

			$_SESSION["UserId"]			= $EntUser->UserId ;		// ユーザーID
			$_SESSION["Email"]			= $EntUser->Email ;			// Email
			$_SESSION["UserName"]		= $EntUser->UserName;		//ユーザー名
			$_SESSION["Permission"]		= $EntUser->Permission ;	// 権限

			// トップページへ移動
				global	$URL_PAGE_TOP	;

			header( 'Location:'. $URL_PAGE_TOP ) ;
			exit ;

		} else {
			$this->login_error = 1 ;
		}
	}


	/*----------------------------------------------------------------------------*/
	//
	//  1.概要
	//      ログインチェック
	//
	//  2.パラメータ説明
	//      なし
	//
	//  3.戻り値
	//      なし
	//
	//  4.機能説明
	//      なし
	//
	/*----------------------------------------------------------------------------*/
	public function loginCheck()
	{
		if ( $_SESSION["UserId"] == '' ) {
				global	$URL_PAGE_LOGIN	;

			header( 'Location:'. $URL_PAGE_LOGIN ) ;		//	ログインページへ
			exit ;
		}
	}


	/*----------------------------------------------------------------------------*/
	//
	//  1.概要
	//      ログアウト
	//
	//  2.パラメータ説明
	//      なし
	//
	//  3.戻り値
	//      なし
	//
	//  4.機能説明
	//      なし
	//
	/*----------------------------------------------------------------------------*/
	public function logoutTry()
	{
		unset( $_SESSION ) ;
		session_destroy() ;
	}


	/*----------------------------------------------------------------------------*/
	//
	//  1.概要
	//      ログインしているユーザーIDを、セッションから取り出す
	//
	//  2.パラメータ説明
	//      <I>
	//
	//  3.戻り値
	//      ログインしているユーザーID
	//
	//  4.機能説明
	//      なし
	//
	/*----------------------------------------------------------------------------*/
	public static function get_login_UserId_from_session()
	{
		return ( $_SESSION["UserId"] ) ;
	}


	/*----------------------------------------------------------------------------*/
	//
	//  1.概要
	//      ログインしているユーザー名を、セッションから取り出す
	//
	//  2.パラメータ説明
	//      <I>
	//
	//  3.戻り値
	//      ログインしているユーザーID
	//
	//  4.機能説明
	//      なし
	//
	/*----------------------------------------------------------------------------*/
	public static function get_login_Email_from_session()
	{
		return ( $_SESSION["login"]["Email"] ) ;
	}



//制限チェック
	public function powerCheck(){
		//
	}


} // class


?>
